Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་བསྒོམ་པ་མང་བ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ abundant contemplation of dependent origination consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདོད་ཆགས་སྐྱེས་པ་དང་། ཁྲོ་བ་སྐྱེས་པ་དང་། གནོད་སེམས་ཀྱི་སེམས་སྐྱེས་ན་འདི་སྙམ་དུ་སེམས་སོ།
en: When desire, anger, or a wish to harm arises, bodhisattvas think as follows:

source: ཆོས་འདི་སུ་ལ་སྐྱེ་བ་དེ་ཡང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའོ།
en: ‘The one for whom this phenomenon arises is dependently arisen,

source: ཆོས་གང་སྐྱེ་བ་དེ་ཡང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའོ། །རྐྱེན་གང་དག་གིས་སྐྱེ་བ་དེ་དག་ཀྱང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའོ།
en: the phenomenon that arises is also dependent origination, and so are the conditions due to which it arises.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཆོས་གསོག་དེ་དག་ལ་མཁས་པའི་རང་བཞིན་ཅན་སུ་ཞིག་བདག་ལ་རྨ་འབྱིན་སྙམ་སྟེ།
en: What wise person would be hurt by a gathering of such dependently arisen phenomena?’

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་བསྒོམ་པ་མང་བ་ཡིན་ནོ།
en: Such is the bodhisattvas’ abundant contemplation of dependent origination.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སྐྱོན་ལ་མཁས་པ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ expertise with regard to flaws consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་བདག་གི་རྒྱུད་ལ་སྐྱོན་ཡོད་པ་དེ་དག་སྤང་བའི་ཕྱིར་ནན་ཏན་དུ་བྱེད་གཞན་གྱི་རྒྱུད་ལ་ཡོད་པ་མི་ནུས་པའི་རང་བཞིན་དེ་དག་ལ་ཡང་བཏང་སྙོམས་སུ་གནས་སོ།
en: Bodhisattvas persist in giving up the flaws in their own being, whereas they remain indifferent to the flaws of others, which are beyond their influence.

source: སྐྱོན་དེ་དག་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What does flaw here refer to?

source: སངས་རྒྱས་ལ་རི་མོ་མི་བྱེད་པ་དང་། ཆོས་དང་། དགེ་འདུན་དང་། བསླབ་པ་དང་། འཕགས་པ་རྣམས་དང་། ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྒན་རབས་དང་། བར་མ་དང་། གསར་བུ་རྣམས་ལ་རི་མོ་མི་བྱེད་པ་ནི་སྐྱོན་ནོ།
en: a lack of respect for the buddhas, as well as a lack of respect for the Dharma, the saṅgha, the training, the noble ones, and those who maintain pure conduct, whether senior, intermediate, or beginners.

source: བདག་ལ་རི་མོ་བྱེད་པ་དང་། གཞན་ལ་བརྙས་པ་དང་།
en: to venerate oneself while disparaging others;

source: ཡུལ་ལ་མངོན་དུ་ཕྱོགས་པ་དང་། མྱ་ངན་ལས་འདས་པ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་དང་།
en: to pursue objects while turning one’s back on the transcendence of suffering;

source: བདག་ཏུ་ལྟ་བ་དང་། སེམས་ཅན་དུ་ལྟ་བ་དང་། སྲོག་ཏུ་ལྟ་བ་དང་། གང་ཟག་ཏུ་ལྟ་བ་དང་།
en: to believe in a self, a sentient being, a life-force, or a person;

source: ཆད་པར་ལྟ་བ་དང་། རྟག་པར་ལྟ་བ་དང་། སྟོང་པ་ཉིད་དུ་འཛིན་པ་དང་། རྟག་པར་འཛིན་པ་དང་། མི་རྟག་པར་འཛིན་པ་དང་།
en: to hold a view of annihilation or of permanence; to grasp things as being empty, permanent, or impermanent;

source: འཕགས་པ་རྣམས་ལ་མཉེས་པར་མི་བྱེད་པ་དང་། བྱིས་པའི་སྐྱེ་བོ་དང་སྟེན་པ་དང་།
en: to not serve noble beings; to attend to childish beings;

source: ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཡོངས་སུ་སྤོང་བ་དང་།
en: to relinquish those who observe discipline;

source: སེམས་ཅན་ངན་པའི་ངང་ཚུལ་ཅན་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་། སྡིག་པའི་གྲོགས་པོ་ལ་སྟེན་པ་དང་།
en: to venerate sentient beings of inferior character; to attend to unvirtuous company;

source: དགེ་བའི་བཤེས་གཉེན་ཡོངས་སུ་སྤོང་བ་དང་། མདོ་སྡེ་ཟབ་མོ་སྤོང་བ་དང་།
en: to abandon spiritual teachers; to abandon the profound discourses;

source: མདོ་སྡེ་ཟབ་མོས་སྐྲག་པ་དང་།
en: to be frightened by the profound discourses;

source: སྙོམ་ལས་དང་། ལེ་ལོ་དང་། བདག་ལ་བརྙས་པ་དང་། གཟི་བརྗིད་ཆུང་བ་དང་།
en: to be indolent; to be lazy; to disparage oneself; to be undignified;

source: སྤོབས་པ་མེད་པ་དང་།
en: to lack eloquence;

source: གནས་མ་ཡིན་པ་ལ་འགྱོད་པ་དང་། མི་འགྱོད་པ་ལ་འགྱོད་པ་དང་། འགྱོད་པ་ལ་མི་འགྱོད་པ་དང་།
en: to regret what is wrong to regret; to regret what should not be regretted; failing to regret what should be regretted;

source: སྒྲིབ་པ་ཀུན་ནས་ལྡང་བས་གླགས་པ་དང་།
en: to be overcome by the eruption of obscurations;

source: གཡོ་སྒྱུས་བཅིངས་པ་དང་།
en: to be tied down by deceit;

source: རྨུགས་ཤིང་གཉིད་ཀྱིས་ནོན་པ་དང་།
en: to be oppressed by drowsiness and sleep;

source: རྙེད་པ་དང་། བཀུར་སྟི་འདོད་པ་དང་། རུས་ལ་འདོད་ཆགས་པ་དང་། རིགས་ལ་འདོད་ཆགས་པ་དང་།
en: to wish for wealth and honor; to be attached to one’s family line; to be attached to caste;

source: ལྟ་བ་ལ་འདོད་ཆགས་པ་དང་། ཡུལ་ལ་འདོད་ཆགས་པ་དང་། འཁོར་ལ་འདོད་ཆགས་པ་དང་།
en: to be attached to views; to be attached to country; to be attached to a retinue;

source: འཇིག་རྟེན་རྒྱང་པན་གྱི་གསང་ཚིག་ལ་སྟེན་པ་དང་།
en: to indulge in the spells of the Lokāyatas;

source: དམ་པའི་ཆོས་ལས་འབྱོལ་བ་དང་། ཡི་དམ་འདོར་བ་དང་།
en: to step away from the true Dharma; to give up one’s commitment;

source: མི་དགེ་བ་དང་ལྡན་པ་དག་ལ་རྩོལ་བ་དང་། དགེ་བ་དང་ལྡན་པ་དག་ལ་མི་རྩོལ་བ་དང་།
en: to strive for what is unvirtuous; not to strive for what is virtuous;

source: རབ་ཏུ་བྱུང་བ་དང་སྡེ་བ་དང་།
en: to associate with the ordained;

source: སྐྱེས་པ་དང་སྡེ་བ་དང་། བུད་མེད་དང་སྡེ་བ་དང་། ཁྱེའུ་དང་བུ་མོ་དང་སྡེ་བ་དང་།
en: to associate with men; to associate with women; to associate with boys and girls;

source: མུ་སྟེགས་ཅན་དང་སྡེ་བ་དང་།
en: to associate with non-Buddhists;

source: དགོན་པ་ལ་མངོན་པར་མི་དགའ་བ་དང་། ཟས་ཀྱི་ཚོད་མི་ཤེས་པ་དང་།
en: not to enjoy the wilderness; not knowing moderation with respect to food;

source: བླ་མའི་དྲུང་དུ་མི་འགྲོ་བ་དང་། ཁ་ཏོན་གྱི་དུས་མི་ཤེས་པ་དང་།
en: failing to go before spiritual masters; not chanting in a timely way;

source: སྤྱོད་ཡུལ་གྱི་གནས་མི་ཤེས་པ་དང་། བསླབ་པ་ཕྲ་མོ་དག་ལ་གུས་པར་མི་བྱེད་པ་དང་།
en: to be ignorant about the key points of practice; to disregard the minor points of training;

source: སྡིག་པ་ཆུང་ངུ་རྣམས་ལ་འཇིགས་པར་མི་ལྟ་བ་དང་། དབང་པོ་གཏི་མུག་གིས་བསྒྲིབས་པ་དང་ལྡན་པ་དང་།
en: failing to see lesser evils as frightening; to be dull and with obscured faculties;

source: གཡེང་བ་ལ་དབང་པོ་གྲིམས་པ་དང་། རྒོད་པར་སྤྱོད་པ་དང་། བཅོས་དཀའ་བ་དང་། བཀའ་བློ་མི་བདེ་བ་དང་།
en: to be focused on diversions; to act with agitation; to be obstinate; to be stubborn;

source: ཡིད་དུ་འོང་བ་དང་། ཡིད་དུ་མི་འོང་བའི་གཟུགས་དག་ལ་མཚན་མ་དང་། མངོན་རྟགས་སུ་འཛིན་པ་དང་།
en: to grasp at marks and signs concerning delightful and repulsive forms;

source: ན་བས་སྐྱོ་བར་མི་བྱེད་པ་དང་། ཤི་བས་མི་སྐྲག་པ་དང་།
en: not being saddened by disease; not being frightened by death;

source: ཀུན་ནས་འབར་བ་ལས་མི་འབྱུང་བ་དང་།
en: not turning away from the inferno;

source: ལུས་ལ་སོ་སོར་མི་རྟོག་པ་དང་། ཚུལ་ཁྲིམས་ལ་སོར་མི་རྟོག་པ་དང་།
en: not examining the body; not examining one’s discipline;

source: ཅི་བྱས་ཅི་བྱེད་ཅི་བྱ་ཞེས་སོ་སོར་མི་རྟོག་པ་དང་། མི་བསམ་པ་ལ་སེམས་པ་དང་། མི་བརྟག་པ་ལ་རྟོག་པ་དང་།
en: not examining one’s past and present actions; to be concerned with what is irrelevant; to examine what should not be examined;

source: མི་སྨོན་པ་ལ་སྨོན་པ་དང་། མི་འབྱུང་བ་ལ་འབྱུང་བར་འདུ་ཤེས་པ་དང་།
en: to wish for that which should not be desired; to believe that things arise where they do not;

source: མི་དགའ་བ་ལ་དགའ་བར་འདུ་ཤེས་པ་དང་། ལམ་མ་ཡིན་པ་ལ་ལམ་དུ་འདུ་ཤེས་པ་དང་།
en: to take what is not delightful to be delightful; to take what is not the path to be the path;

source: མ་ཐོབ་པ་ལ་ཐོབ་པར་འདུ་ཤེས་པ་དང་།
en: to believe that one has attained what has not been attained;

source: འཕྲལ་གྱི་བྱ་བ་ལ་ཆགས་པ་དང་། བྱེད་པ་ངན་པས་གཡེངས་པ་དང་། དགེ་བའི་ཕྱོགས་རྒྱ་ཆེན་པོ་རྣམ་པར་སྤོང་བ་དང་།
en: to be attached to temporary projects; to be distracted by negative activity; to give up vast factors of virtue;

source: ཐེག་པ་ཆེན་པོ་ལ་མི་བསྔགས་པ་བརྗོད་པ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་བསྔགས་པ་བརྗོད་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་མངོན་པར་དད་པའི་གང་ཟག་རྣམས་ལ་མི་བསྔགས་པ་བརྗོད་པ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་མངོན་པར་དད་པའི་གང་ཟག་རྣམས་ལ་བསྔགས་པ་བརྗོད་པ་དང་།
en: not praising the Great Vehicle; to praise the Hearers’ Vehicle; not praising people who have faith in the Great Vehicle; to praise people who have faith in the Hearers’ Vehicle;

source: རྩོད་པ་ལྷུར་ལེན་པ་དང་། འཐབ་པའི་ངང་ཚུལ་ཅན་དང་། བརླང་བ་དང་། རྩུབ་པ་དང་། ཕོ་ཐེག་ཅན་དང་། སྤྱི་རྟོལ་ཆེ་བ་དང་། གཏུམ་པ་དང་། གདུག་པ་དང་། ངག་མི་སྙན་པ་དང་། མུ་ཅོར་སྨྲ་བ་དང་། མི་གཙིགས་པར་སྨྲ་བ་དང་། ངན་དུ་སྨྲ་བས་སྨྲ་བ་དང་། བརྫུན་ཟེར་བ་དང་། སྤྲོས་པ་ལ་མངོན་པར་དགའ་བ་དང་། སྤྲོས་པ་ལ་གཞོལ་བ་
en: to engage in passionate dispute; to be inclined to quarrel; to be abusive; to be vicious; to be haughty; to be impudent; to be ferocious; to be malicious; to be disparaging; to be audacious; to be improper; to denigrate; to lie; to be fond of mental constructs; and to pursue mental constructs.

source: དེ་དེ་ལྟར་སྐྱོན་ལ་མཁས་པས་སྤྲོས་པ་ཐམས་ཅད་དང་བྲལ་བར་བྱ་བའི་ཕྱིར་སྟོང་པ་ཉིད་སྒོམ་པ་ལ་རྣལ་འབྱོར་དུ་བྱེད་དོ།
en: “Understanding such flaws, bodhisattvas engage in the practice of contemplating emptiness for the sake of going beyond all mental constructs.

source: དེ་སྟོང་པ་ཉིད་ལ་སྒོམ་པ་མང་བས་གནས་གང་དང་གང་དག་ལ་སེམས་འཇུག་ཅིང་སེམས་མངོན་པར་དད་པའི་གནས་དེ་དང་དེ་དག་ལ་ངོ་བོ་ཉིད་ཡོངས་སུ་བཙལ་ན་སྟོང་པར་རྟོགས་སོ།
en: Through their abundant contemplation of emptiness, they investigate the nature of whatever their minds pursue and have faith in, realizing it all to be empty.

source: སེམས་དེ་གང་ཡིན་པ་དེ་ཡང་ཡོངས་སུ་བརྟགས་ན་སྟོང་པའོ།
en: They likewise investigate what the mind is, realizing it to be empty.

source: གང་གིས་བརྟགས་པ་དེ་ཡང་སྟོང་པར་རྟོགས་སོ།
en: They also realize the means of investigation to be empty.

source: དེ་དེ་ལྟར་རྟོགས་པས་མཚན་མ་མེད་པ་ལ་རྣལ་འབྱོར་དུ་བྱེད་དོ།
en: “With such realization, bodhisattvas take up the practice of the absence of marks.

source: དེ་ལ་ནང་གི་མཚན་མ་གང་དང་གང་སྣང་བར་གྱུར་པ་དེ་དང་དེ་དག་མཚན་མ་མེད་པར་བྱེད་དོ།
en: Through this practice they make all manifest inner marks disappear.

source: ཅི་ནས་ཀྱང་ལུས་མི་དམིགས་པ་དང་། ལུས་ལ་དྲན་པ་ཉེ་བར་མི་འཇོག་པ་དང་། ལུས་ལ་སེམས་མི་གཏོང་བ་དང་།
en: In this way they avoid any form of observation of the body and any application of mindfulness to the body, and they do not direct their minds to the body.

source: ཕྱི་རོལ་གྱི་མཚན་མ་རྣམས་མི་དམིགས་པ་དང་། ཕྱི་རོལ་གྱི་མཚན་མ་རྣམས་ལ་དྲན་པ་ཉེ་བར་མི་འཇོག་པ་དང་། སེམས་མི་གཏོང་བ་དེ་ལྟར་མཚན་མ་མེད་པར་བྱེད་དོ།
en: They also do not observe any outer marks, nor do they apply mindfulness to, or direct their minds toward, any outer marks.

source: དེ་ཕྱི་རོལ་གྱི་མཚན་མ་རྣམས་དང་བྲལ་བ་དང་། ལུས་ཀྱི་མཚན་མ་རྣམས་དང་བྲལ་བས་ནང་གི་མཚན་མ་རྣམས་སྤང་བའི་ཕྱིར་ཞུགས་ཏེ། སྒོམ་པ་ལ་མངོན་པར་དགའ་བ་སྐྱེད་དོ།
en: Thus free from any outer marks and free from the marks of the body, they practice to give up inner marks, finding great joy in their practice.

source: དེ་སྒོམ་པ་མང་བས་རྟག་ཏུ་སྒོམ་པ་ལ་བརྩོན་པ་ཡིན།
en: “In this way they engage in abundant contemplation and are diligent in their training.

source: རྒྱུན་མི་ཆད་པར་ཞི་གནས་དང་། ལྷག་མཐོང་ལ་གནས་པས་གནས་པ་ཡིན།
en: They continuously remain within tranquility and special insight.

source: དེ་ལ་ཞི་གནས་ནི་སེམས་རྩེ་གཅིག་པའོ། །ལྷག་མཐོང་ནི་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་ལ་སོ་སོར་རྟོག་པའོ།
en: Tranquility is one-pointed mind. Special insight is to discern phenomena as they actually are.

source: དེ་སེམས་མཉམ་པར་གཞག་པས་འགྱོད་པ་མེད་ཅིང་རབ་ཏུ་དགའ་བ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: As they remain in equipoise in this way, they are free of regrets and very joyful.

source: དེ་ལྟར་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པའི་ཕྱིར་རོ།
en: Because in this way their discipline is pure.

source: ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་རྣལ་འབྱོར་སྤྱོད་པ་ཡིན་ཏེ།
en: Bodhisattvas with pure discipline are engaged in practice,

source: ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ལ་ནི་རྣལ་འབྱོར་ཡང་དག་པར་འགྲུབ་བོ།
en: those with perfect discipline accomplish their practice.

source: ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ནི་རྣལ་འབྱོར་ལ་སྤྱོད་དེ། དེ་བས་ན་རྣལ་འབྱོར་ལ་སྤྱོད་པ་རྣམས་ཞེས་བྱའོ།
en: Those with perfect discipline engage in practice. That is why they are known as those who engage in practice.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣལ་འབྱོར་སྤྱོད་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities are engaged in yogic practice.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་མདོ་སྡེ་འཛིན་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities are specialists in the discourses.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དམ་པའི་ཆོས་ཀུན་བསྲུང་བའི་ཕྱིར་ཐོས་པ་འཛིན་གྱི་ཟང་ཟིང་གི་ཕྱིར་མ་ཡིན་ནོ།
en: What are those ten? They are as follows. Bodhisattvas retain what they have heard for the sake of protecting the sacred Dharma, and not for the sake of material gain.

source: བསྟན་པ་ཀུན་བསྲུང་བའི་ཕྱིར་ཐོས་པ་འཛིན་གྱི་རྙེད་པའི་ཕྱིར་མ་ཡིན་ནོ།
en: They retain what they have heard for the sake of protecting all the teachings, and not for the sake of acquisitions.

source: དཀོན་མཆོག་གསུམ་གྱི་རིགས་མི་འཆད་པའི་ཕྱིར་ཐོས་པ་འཛིན་གྱི་བཀུར་སྟིའི་ཕྱིར་མ་ཡིན་ནོ།
en: They retain what they have heard for the sake of keeping the lineage of the Three Jewels unbroken, and not for the sake of honor.

source: ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་རྗེས་སུ་གཟུང་བའི་ཕྱིར་ཐོས་པ་འཛིན་གྱི་གྲགས་པ་དང་། སྒྲ་དང་། ཚིགས་སུ་བཅད་པའི་ཕྱིར་མ་ཡིན་ནོ།
en: They retain what they have heard for the sake of protecting those who have truly entered the Great Vehicle, and not for the sake of fame, praise, and glory.

source: མགོན་མེད་པའི་སེམས་ཅན་རྣམས་ལ་ཕན་པར་བྱ་བའི་ཕྱིར་ཐོས་པ་འཛིན་ཏོ།
en: They retain what they have heard for the sake of benefiting others who have no protector.

source: སྡུག་བསྔལ་བའི་སེམས་ཅན་རྣམས་ལ་བདེ་བར་བྱ་བའི་ཕྱིར་ཐོས་པ་འཛིན་ཏོ།
en: They retain what they have heard for the sake of giving happiness to suffering sentient beings.

source: ཤེས་རབ་ཀྱི་མིག་དང་བྲལ་བའི་སེམས་ཅན་རྣམས་ཤེས་རབ་ཀྱི་མིག་འཐོབ་པར་བྱ་བའི་ཕྱིར་ཐོས་པ་འཛིན་ཏོ།
en: They retain what they have heard for the sake of giving the eye of insight to those who lack it.

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པའི་ལམ་བསྟན་པའི་ཕྱིར་ཐོས་པ་འཛིན་ཏོ།
en: They retain what they have heard for the sake of showing the path of the hearers to those who have truly entered the Hearers’ Vehicle.

source: ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ལ་ཐེག་པ་ཆེན་པོའི་ལམ་བསྟན་པའི་ཕྱིར་ཐོས་པ་འཛིན་ཏོ།
en: They retain what they have heard for the sake of showing the path of the Great Vehicle to those who have truly entered the Great Vehicle.

source: བདག་ཉིད་ཀྱང་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་ཐོས་པ་འཛིན་གྱི་ཐེག་པ་ཆུང་ངུ་ལ་ནི་མི་སྨོན་ཏོ།
en: They retain what they have heard so that they themselves will comprehend the unsurpassable wisdom, not out of an aspiration toward the Lesser Vehicle.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་མདོ་སྡེ་འཛིན་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities are specialists in the discourses.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་འདུལ་བ་འཛིན་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities are specialists in the discipline.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འདུལ་བ་ཡང་རབ་ཏུ་ཤེས། འདུལ་བའི་ཚུལ་ཡང་རབ་ཏུ་ཤེས། འདུལ་བ་ཟབ་པ་ཡང་རབ་ཏུ་ཤེས། འདུལ་བ་ཞིབ་པ་ཡང་རབ་ཏུ་ཤེས། རུང་བ་དང་མི་རུང་བ་ཡང་རབ་ཏུ་ཤེས། རང་བཞིན་གྱིས་ཁ་ན་མ་ཐོ་བ་ཡང་རབ་ཏུ་ཤེས། བཅས་པའི་ཁ་ན་མ་ཐོ་བ་ཡང་རབ་ཏུ་ཤེས། སོ་སོར་ཐར་པའི་བསླབ་པའི་གླེང་གཞི་དང་འབྱུང་བ་ཡང་རབ་ཏུ་ཤེས། ཉན་ཐོས་ཀྱི་འདུལ་བ་ཡང་རབ་ཏུ་ཤེས། བྱང་ཆུབ་སེམས་དཔའི་འདུལ་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: What are those ten? They have full knowledge of the discipline, full knowledge of the way of discipline, full knowledge of the profound discipline, full knowledge of the detailed discipline, full knowledge of what is right and wrong, full knowledge of natural evils, full knowledge of prohibited evils, full knowledge of the circumstances that led to the regulations for prātimokṣa, full knowledge of the discipline of the hearers, and full knowledge of the discipline of the bodhisattvas.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་འདུལ་བ་འཛིན་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities are specialists in the discipline.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོ་ག་དང་། སྤྱོད་ཡུལ་དང་། སྤྱོད་པ་དང་། སྤྱོད་ཡུལ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas who possess ten qualities are perfect in conduct, personal associations, behavior, and deportment.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཉན་ཐོས་ཀྱི་བསླབ་པ་དག་ལ་ཤིན་ཏུ་བསླབས་པ་རྣམས་ཡིན། རང་སངས་རྒྱས་ཀྱི་བསླབ་པ་དག་ལ་ཤིན་ཏུ་བསླབས་པ་རྣམས་ཡིན། བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་དག་ལ་ཤིན་ཏུ་བསླབས་པ་རྣམས་ཡིན།
en: What are those ten? Such bodhisattvas possess an extremely high degree of accomplishment in the training of hearers, an extremely high degree of accomplishment in the training of solitary buddhas, and an extremely high degree of accomplishment in the training of bodhisattvas.

source: དེ་དག་ཤིན་ཏུ་བསླབས་པས་ན་ཆོ་ག་དང་སྤྱོད་ཡུལ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན།
en: With such accomplishments, their conduct and personal associations are excellent,

source: ཆོ་ག་དང་སྤྱོད་ཡུལ་ཕུན་སུམ་ཚོགས་པས་དགེ་སྦྱོང་གི་ཚུལ་དང་འཐུན་པ་མ་ཡིན་པའི་སྤྱོད་ཡུལ་རྣམས་ཡོངས་སུ་སྤོང་ངོ་།
en: because their conduct and personal associations are excellent, they avoid any personal associations that are in discord with the way of a spiritual practitioner.

source: དེ་དག་དེའི་ཕྱིར་གནས་མ་ཡིན་པར་མི་སྤྱོད། ཡུལ་མ་ཡིན་པ་དང་། དུས་མ་ཡིན་པར་མི་སྤྱོད།
en: Hence, they stay clear of all improper fields, objects, and timings.

source: དེ་དག་དགེ་སྦྱོང་གི་སྤྱོད་ཡུལ་ལ་སྤྱོད་པས་སྤྱོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ཏེ།
en: As they pursue personal associations with spiritual practitioners, their conduct is excellent.

source: དགེ་སྦྱོང་ངམ། བྲམ་ཟེས་འདི་ལྟ་སྟེ། དོན་དང་མི་ལྡན་པ་དེ་དང་། དེས་མཚང་འདྲུར་མེད་ལ་
en: They have no hidden faults to expose, by either mendicants or brahmins, due to any kind of impropriety.

source: གཞན་དག་ཀྱང་བསླབ་པ་དེ་སྙེད་ལ་འཇོག་པར་བྱེད་དོ།
en: Instead, they establish others in that very training.

source: དེ་དག་སྤྱོད་པ་ཕུན་སུམ་ཚོགས་པས་སྤྱོད་ལམ་མཛེས་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན། སྤྱོད་ལམ་རབ་ཏུ་ཞི་བས་སྤྱོད་ལམ་བཅོས་པ་མེད་པ་དང་ལྡན་པ་ཡིན་ནོ།
en: Due to their excellent personal associations, their conduct is perfect and elegant and, as their conduct is very peaceful, they possess conduct that is uncontrived.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོ་ག་དང་། སྤྱོད་ཡུལ་དང་། སྤྱོད་པ་དང་། སྤྱོད་ལམ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities are perfect in conduct, personal associations, behavior, and deportment.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེར་སྣ་དང་ཕྲག་དོག་དང་བྲལ་བ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities are free from stinginess and envy.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བདག་ཉིད་ཀྱང་སྦྱིན་པའི་བདག་པོ་ཡིན། གཞན་ཡང་སྦྱིན་པ་ལ་ཡང་དག་པར་འཛུད།
en: What are those ten? They are as follows. When they themselves are donors, they also establish others in the practice of generosity.

source: སྦྱིན་པའི་བསྔགས་པ་སྨྲ་བ་རྣམས་ཡིན། གཞན་དག་གིས་བྱིན་པ་ལ་རྗེས་སུ་ཡི་རང་བར་བྱེད།
en: They praise generosity and rejoice in the generosity of others.

source: སྦྱིན་པའི་བདག་པོ་གཞན་དག་ལ་ཡང་གཟེངས་སྟོད་ཅིང་རབ་ཏུ་དགའ་བར་བྱེད།
en: With regard to other donors, they encourage and delight them.

source: གཞན་དག་ལ་བྱིན་ན་ཡང་འདི་སྙམ་དུ་བདག་ཅག་ལ་བྱིན་ཅིག་གཞན་ལ་ནི་མ་ཡིན་ནོ། །བདག་ཅག་གིར་གྱུར་ལ། གཞན་དག་གིར་མ་གྱུར་ཅིག་ཅེས་སེམས་མི་སྐྱེད།
en: When donors are giving to others, they have no thoughts such as, ‘Give to us, and not them! May this be ours and not anyone else’s!’

source: འདི་སྙམ་དུ་འདི་ལྟ་སྟེ། སེམས་ཅན་ཐམས་ཅད་འཚོ་བའི་ཡོ་བྱད་དེ་དང་དེ་དག་ཐོབ་པར་གྱུར་ཅིག་ཅེས་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་བདེ་བ་དང་ལྡན་ཏེ་བདེ་བར་གྱུར་ཅིག
en: Rather, they wish, ‘May all beings attain whatever they need for their livelihood! May they attain all manner of happiness, both of the world and beyond it!’

source: བདག་ཅག་གིས་ཀྱང་དེ་ཉིད་ཀྱི་དོན་དུ་འབད་པར་བྱ། བཙལ་བར་བྱའི། བདག་ཅག་གིས་དེར་སེར་སྣ་དང་། ཕྲག་དོག་གི་སེམས་བསྐྱེད་པར་མི་བྱའོ་ཞེས་སེམས་སྐྱེད་དོ།
en: Thus, committing themselves to striving and endeavoring for this very purpose, they decide to give up stinginess and envy.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེར་སྣ་དང་ཕྲག་དོག་དང་བྲལ་བ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities are free from stinginess and envy.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities have equal concern for all beings.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྙོམས་པར་སྦྱོར་བ་རྣམས་ཡིན། སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བའི་སེམས་མེད་པ་རྣམས་ཡིན། སེམས་ཅན་ཐམས་ཅད་ལ་གནོད་སེམས་མེད་པ་རྣམས་ཡིན།
en: They engage equally with all sentient beings, have no aversion for any sentient being, nor any wish to harm anyone.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་ཁོ་ནར་སྦྱིན་པ་དག་སྦྱིན། ཚུལ་ཁྲིམས་སྲུང་། བཟོད་པ་སྒོམ། བརྩོན་འགྲུས་རྩོམ། བསམ་གཏན་ལ་བསམ་གཏན་དུ་བྱེད། ཤེས་རབ་སྒོམ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་ཡང་དག་པར་སྒྲུབ་མོད་ཀྱི།
en: In giving, they give exclusively for the sake of all sentient beings, and the same is the case with observing discipline, cultivating patience, mustering diligence, practicing concentration, cultivating insight, and accomplishing even the stage of omniscience.

source: གཉིས་ལ་གནས་པའི་སེམས་ཀྱིས་སྒྲུབ་པ་མ་ཡིན་གྱི། སེམས་ཅན་ཐམས་ཅད་ལ་ཐུན་མོང་གི་སེམས་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་དམིགས་པས་སྒྲུབ་སྟེ།
en: Thus, they do not practice with a mind that is confined to duality, but with a mind that is equally there for all sentient beings, a mind that practices by taking all sentient beings into account.

source: ཅི་ནས་ཀྱང་ཆོས་ཉིད་མྱུར་དུ་འཐོབ་པར་འགྱུར་བ་དེ་ལྟར་སྒྲུབ་བོ།
en: Thus, they practice to attain the intrinsic nature quickly by all means.

source: དེ་དག་འཁོར་བ་རབ་ཏུ་འབར་བ་ནས་བདག་ཉིད་བྱུང་ནས་གཞན་དག་ཀྱང་འབྱིན་ཏེ།
en: As they themselves are delivered from the blazing bonfire of cyclic existence, they also deliver others.

source: དེ་ཡང་མཉམ་པ་ཉིད་ཀྱི་སེམས་ཉེ་བར་བཞག་ཅིང་འབྱིན་གྱི་སྡུག་པའི་སེམས་ཀྱིས་མ་ཡིན་ཏེ། ཁོང་ཁྲོ་བས་མ་ཡིན་ནོ།
en: Moreover, they liberate others with an attitude that treats everyone the same, rather than through an attitude of being fond or hostile.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཚོང་དཔོན་ནམ་ཁྱིམ་བདག་ལ་བུ་སྡུག་པ་ཕངས་པ་བྱམས་པ་ཡིད་དུ་འོང་བ་དྲུག་ཅིག་ཡོད་ལ།
en: “Noble son, this is how it is. As an analogy, think of a merchant or householder who has six dearly cherished, beloved, and adored children.

source: བུ་དེ་དག་ལ་ཚོང་དཔོན་ནམ་ཁྱིམ་བདག་དེ་མཚུངས་པར་བྱམས་ཤིང་། མཚུངས་པར་སྦྱོར་བར་གྱུར་པ་ལས་
en: The merchant or householder loves all of them equally, and he treats them all equally.

source: དེའི་བུ་དེ་དག་བྱིས་པ་ཡིན་ཏེ། གོག་པ་མི་ཤེས་པ་མི་མཁས་པ་དག་ཅིག་ཡོད་ལ།
en: All the children are infants who crawl around, unaware and unskilled.

source: དེ་ནས་ཚོང་དཔོན་ནམ་ཁྱིམ་བདག་དེའི་ཁྱིམ་མེ་ཐར་ཏེ། དེའི་བུ་དེ་དག་ཀྱང་སོ་སོ་ན་འཁོད་པར་གྱུར་ན།
en: Now imagine that this merchant’s or householder’s house catches fire while the children are all in different places.

source: ཚོང་དཔོན་ནམ་ཁྱིམ་བདག་དེ་འདི་ནི་སྔར་ཇེ་དབྱུང་ངོ་། །དེ་ནས་ཕྱིས་འདི་དབྱུང་ངོ་སྙམ་དུ་དེ་ལྟར་སེམས་སམ།
en: Would that merchant or householder be thinking, ‘Let me get such-and-such child out first, and then the other children’?”

source: བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་གསོལ་པ། བཅོམ་ལྡན་འདས་མ་ལགས་སོ།
en: “No, Blessed One, he would not,” answered the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་
en: “And why would he not think like this? Because, Blessed One,

source: ཚོང་དཔོན་ནམ་ཁྱིམ་བདག་དེ་བུ་རྣམས་ལ་སེམས་སྙོམས་པས་དེ་གང་དང་གང་དག་ཇི་ལྟར་མཇལ་བ་དེ་དང་དེ་ཉིད་དེ་བཞིན་དུ་འབྱིན་ཏོ།
en: that merchant or householder has equal concern for all the children. He would, therefore, deliver them from the house whenever he encountered them.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་
en: “Similarly, noble son,” continued the Blessed One,

source: བྱིས་པ་ལྟ་བུའི་སེམས་ཅན་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའི་བུ་དང་འདྲ་སྟེ། འཕགས་པ་རྣམས་ནི་མ་ཡིན་ཏེ།
en: “all infantile sentient beings are like the bodhisattvas’ own children, not noble beings.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་བྱིས་པ། མི་གསལ་བ། མི་མཁས་པ། འགྲོ་བ་དྲུག་སོ་སོ་ན་གནས་པ་
en: Bodhisattvas see these infantile, dull, and unskilled beings that are present in each of the six realms.

source: དེ་དག་འཁོར་བའི་ཁྱིམ་མེ་ཐར་བ་ནས་གང་དང་གང་ཇི་ལྟར་ཡོངས་སུ་སྨིན་པར་འགྱུར་བ་དེ་དང་དེ་ཉིད་དེ་ལྟར་འབྱིན་ཏོ།
en: In accordance with these beings’ level of maturation, bodhisattvas will deliver them from the burning house of cyclic existence.
